{
  "Acanthostega": "one of the first animals with limbs! It had a flat, shovel-like head and could move on land, but it still spent most of its time in the water",
  "Acrocanthosaurus": "a massive hunter with a sail-like structure on its back",
  "Aepyornis": "the \"elephant bird\". This flightless bird was a giant, with a towering height and weighing over 1,000 pounds",
  "Alamosaurus": "a giant sauropod. It was one of the very last sauropods to exist before the dinosaurs went extinct",
  "Albertosaurus": "unlike its bulkier cousin, the T-Rex, Albertosaurus was relatively slender and had long, powerful hind legs. Scientists think it was an excellent runner, capable of chasing down prey",
  "Alioramus": "a medium-sized tyrannosaur, with a long snout and small horns",
  "Allosaurus": "a very large hunter. It was a dominant predator of its time",
  "Alphadon": "a small, opossum-like mammal that lived alongside dinosaurs",
  "Amphicoelias": "a huge, plant-eating sauropod dinosaur with a very long neck, like a cousin to Diplodocus. It lived in North America",
  "Anchisaurus": "a medium-sized dino. Scientists first thought it ate meat, but now we know it was a plant-eater",
  "Ankylosaurus": "the \"armored tank\" of the dinosaur world! This plant-eater was covered head-to-toe in thick, bony plates and had a giant, bony club on its tail for defense",
  "Anurognathus": "a very small pterosaur with a wingspan of only 1 foot. It had a very short tail and probably caught insects in mid-air",
  "Apatosaurus": "the Dinosaur with a Secret Identity! Say hello to one of the biggest animals to ever walk the Earth! The plant-eating Apatosaurus was a truly massive dinosaur. Its name, which means Deceptive Lizard, is one of the coolest in science because it tells an amazing story. Over a century ago, during the famous Bone Wars of the late 1800s, two famous fossil hunters thought they had discovered two different dinosaurs: Apatosaurus and Brontosaurus. They were both huge, long-necked beasts! Soon, scientists decided these two names belonged to just one dino. Apatosaurus was the official winner, and Brontosaurus vanished! But hold on—the mystery isn't over! In a thrilling modern twist, new research has convinced many paleontologists that Brontosaurus was a real, unique dinosaur all along! It’s a scientific comeback story! This long-running debate is proof that even in science, there are still exciting legends waiting to be revived",
  "Araeoscelis": "a small, lizard-like reptile with a long tail and slender limbs",
  "Arandaspis": "one of the earliest to have a head shield made of bony plates",
  "Archaeopteryx": "the earliest known bird. It was a small, bird-like dinosaur with feathers, but it also had teeth and claws on its wings, which shows the link between birds and dinosaurs",
  "Archaeothyris": "a very early pelycosaur. It was a small, lizard-like reptile and one of the earliest known mammal-like reptiles",
  "Archelon": "a gigantic sea turtle, and the largest turtle ever found! It had a broad shell and huge flippers for swimming",
  "Arctops": "arctops was a little bigger than a large dog. It walked on four strong legs",
  "Ardeosaurus": "a small, lizard-like reptile, a type of gecko, with a slender body and a long tail",
  "Argentavis": "one of the largest flying birds ever. It had a gigantic wingspan of up to 23 feet!",
  "Argentinosaurus": "one of the largest animals to ever walk the Earth! This plant-eater, found in Argentina, was a type of sauropod and could grow to be longer than three school buses",
  "Askeptosaurus": "a long, slender marine reptile with a long neck and tail. It was an excellent swimmer and had a very narrow, pointed snout full of sharp teeth for catching fish",
  "Aspidorhynchus": "a fish with a long, slender body and a long, pointed snout",
  "Bactrosaurus": "an early type of \"duck-billed\" dinosaur (Hadrosaur). It was a plant-eater that was smaller than its later cousins and had a long, strong spine",
  "Barapasaurus": "one of the earliest sauropods",
  "Baryonyx": "an unusual, fish-eating dinosaur It had a long snout and a huge thumb claw",
  "Bernissartia": "a small, slender crocodile, one of the smallest crocs ever found!",
  "Boreaspis": "with its narrow head shield and a snout that curved down, this fish was great at sweeping through mud",
  "Bothriolepis": "a small, armored fish with a flat, shovel-like head shield",
  "Brachiosaurus": "this enormous dino had a giraffe-like posture because its front legs were longer than its back legs",
  "Cacops": "a small amphibian with heavily armored skin",
  "Camarasaurus": "a common sauropod. It had a short, boxy head and a shorter, thicker neck compared to its relatives",
  "Camptosaurus": "a small to medium-sized, quick plant-eating dinosaur that could walk on two legs or four. It's an ancestor to later big plant-eaters like Iguanodon",
  "Canobius": "a small fish with a long body and covered in thick, bony scales",
  "Carcharodontosaurus": "a massive hunter with large, shark-like teeth",
  "Casea": "a plant-eating reptile, with a broad, flat body and a small head",
  "Cearadactylus": "a large pterosaur with a wingspan of 11 feet. It was likely a fish-eater with a hook-like structure on its upper jaw",
  "Centrosaurus": "a plant-eating dinosaur that lived about 75 million years ago. It was a cousin of the more famous Triceratops, but had its own very cool look!",
  "Cephalaspis": "had a broad, horseshoe-shaped head shield that protected its eyes and gills",
  "Ceratodus": "a type of ancient lungfish with large, unique tooth plates that looked a bit like horns. This fish could be found in fresh water all over the world",
  "Ceratosaurus": "a large carnivore, recognized by the horn on its nose and bony crests over its eyes",
  "Ceresiosaurus": "a large swimming reptile with a very long neck and a long, flat tail, perfect for steering and swimming fast in the Triassic oceans",
  "Cetiosaurus": "a large, long-necked herbivorous sauropod, one of the first to be discovered",
  "Champsosaurus": "a large, crocodile-like aquatic reptile with a long snout and tail",
  "Chasmatosaurus": "when we first discovered Chasmatosaurus it was called Proterosuchus. This is an example of Junior and Senior Synomyms with taxonomy. a large, heavily built predator",
  "Chasmosaurus": "a horned dinosaur like Triceratops, but its large neck frill had two huge, 'opening-like' holes. Its name means \"opening lizard.\"",
  "Cheirolepis": "a very early ray-finned fish",
  "Cladoselache": "one of the earliest known sharks. It was streamlined and had two dorsal fins and a symmetrical tail",
  "Claudiosaurus": "a very early member of this group",
  "Climatius": "a spiny shark that was a small, slender fish with rows of spines along its sides for protection",
  "Cobelodus": "a small, deep-bodied shark",
  "Coccosteus": "a small, armored fish with a broad, flat head shield",
  "Coelophysis": "a medium-sized, agile dino. It had grasping claws on its hands",
  "Coelurosauravus": "this reptile had a membrane of skin supported by long bones, allowing it to glide from tree to tree!",
  "Coelurus": "a small, agile dino. It was very similar to Coelophysis and had strong, clawed fingers",
  "Compsognathus": "tiny!. It was once thought to be the smallest dinosaur ever discovered!",
  "Corythosaurus": "a duck-billed dinosaur with a tall, helmet-like crest on its head",
  "Cotylorhynchus": "a large, heavy-bodied plant-eater with a barrel-shaped body",
  "Crassigyrinus": "a large, long-bodied amphibian with a huge mouth and tiny limbs",
  "Crusafontia": "a small, squirrel-like mammal, likely an insectivore",
  "Cryptocleidus": "a medium-sized plesiosaur. It had a long neck, small head, and large flippers",
  "Ctenurella": "a small, armored fish with a broad, flat head shield",
  "Cyclurus": "an extinct type of freshwater ray-finned fish, closely related to the modern bowfin. It had a rounded tail and was a common sight in ancient lakes and rivers",
  "Cymbospondylus": "a very large ichthyosaur, . It had a long, eel-like slender body and a long tail",
  "Cynognathus": "a medium-sized, dog-like reptile. It had a powerful jaw and was a top predator",
  "Dapedium": "a small fish with a deep, flat body",
  "Dartmuthia": "had a head shield with a prominent spine and two large spikes on its sides",
  "Daspletosaurus": "a large tyrannosaurid, a fearsome predator closely related to T-Rex",
  "Deinonychus": "a fast, agile raptor with a distinctive, sickle-shaped claw on each foot",
  "Deinosuchus": "a gigantic crocodile, one of the largest crocodiles ever to live, with jaws powerful enough to crush large dinosaurs",
  "Deltoptychius": "a chimera with a deep, shovel-like head and large fins",
  "Desmatosuchus": "a large, heavily armored reptile with long spikes on its shoulders",
  "Diatryma": "a huge, flightless bird. it had a massive head and a huge, powerful beak",
  "Dicraeosaurus": "a medium-sized sauropod. It had a shorter neck and a unique forked spine on its neck vertebrae",
  "Dicynodon": "a common plant-eater, known for its toothless beak and tusks",
  "Dilophosaurus": "a large hunter famous for the two crests on its head",
  "Dimetrodon": "a famous meat-eater. It was a top predator known for its large, prominent sail",
  "Dimorphodon": "a medium-sized pterosaur with a wingspan of 4 feet. It had a big head with two different types of teeth",
  "Dinichthys": "a large placoderm, similar to Dunkleosteus but smaller",
  "Dinornis": "the moa, the tallest known bird",
  "Diplocaulus": "famous for its unique boomerang-shaped head",
  "Diplodocus": "a very long sauropod, stretching up to 85 feet! It had an extremely long neck and a thin, whip-like tail it could use for defense",
  "Dipnorhynchus": "this 3-foot-long predator had a special, box-like skull fused together like the animals that eventually walked on land, which helped it crush the hard shells of its prey!",
  "Dipterus": "a small lungfish with a long body and a large dorsal fin",
  "Dodo": "the famous flightless bird, unfortunately driven to extinction in the 17th century",
  "Doryaspis": "this fish had a broad, spiky head shield and a long spine on its back. Shaped like a hydrofoil",
  "Drepanaspis": "one of the first ray-like fish! It had a broad, flat, horseshoe-shaped head shield that covered its eyes",
  "Dromaeosaurus": "a small, bird-like theropod, known for its powerful jaws and sharp claws",
  "Dromiceiomimus": "built for speed, with long legs and a long neck, just like an ostrich",
  "Dryosaurus": "a lightweight, fast-running, two-legged plant-eating dinosaur. Its strong legs and stiff tail helped it run away quickly from predators in the Jurassic forests",
  "Dsungaripterus": "a large pterosaur with a wingspan of 10 feet. It had a bony crest on its head and an upward-curving jaw, which may have been used for cracking open shellfish",
  "Dunkleosteus": "a gigantic placoderm with a massive head shield and powerful, scissor-like jaws made of bone",
  "Echinodon": "a tiny dino. It's special because its teeth looked like a mammal's teeth",
  "Edaphosaurus": "a large, plant-eating reptile. It had a prominent sail on its back",
  "Edmontosaurus": "also known as Anatosaurus, This Dino was a very large, common \"duck-billed\" dinosaur (Hadrosaur) that walked on two or four legs. Fossils of its skin show it didn't have a large crest, just a flat head",
  "Efraasia": "a smaller European dino. It probably spent most of its time walking on all fours but could stand up on two legs when it needed to",
  "Elaphrosaurus": "a slender, long-necked, and lightweight theropod, likely a fast runner and might have eaten eggs",
  "Elasmosaurus": "a huge plesiosaur! It had an extremely long neck, a small head, and large flippers",
  "Elginia": "a small, robust reptile, a bit like a miniature version of a pareiasaur",
  "Emeus": "a medium-sized moa",
  "Eogyrinus": "a very large amphibian with a long, snake-like body",
  "Ericiolacerta": "a small, lizard-like reptile",
  "Eryops": "a huge, strong amphibian with a broad, flat head and powerful legs, making it a strong predator",
  "Erythrosuchus": "a giant 'ruling reptile' and one of the largest predators of its time",
  "Eudimorphodon": "a small pterosaur with a wingspan of about 2.5 feet. It was a fish-eater with a long tail and a mouth full of sharp teeth",
  "Euhelopus": "a large sauropod, with a long neck and a shorter tail",
  "Euoplocephalus": "another heavily armored dinosaur like Ankylosaurus, covered in bony plates, but it was famous for having armored eyelids and a big tail club",
  "Euparkeria": "a small, active predator that could run on two legs for short bursts",
  "Eurhinosaurus": "a medium-sized ichthyosaur, known for having a very long, sword-like snout",
  "Eusthenopteron": "scientists call it a 'fish with legs' because the bones in its fins were very similar to the limb bones of early land animals",
  "Eustreptospondylus": "a medium-sized hunter with a large head and powerful jaws",
  "Gallimimus": "the largest of the 'ostrich dinosaurs'. It was a very fast runner, just like the others",
  "Gemuendina": "a small, armored fish with a flat, shovel-like head shield",
  "Gerrothorax": "an aquatic amphibian with an extremely flattened head",
  "Giganotosaurus": "a massive hunter. It was one of the largest land predators ever",
  "Gracilisuchus": "a small, slender, and lightly-built archosaur, an early relative of crocodiles",
  "Great Auk": "a flightless, penguin-like bird. It used its small wings to swim underwater",
  "Greererpeton": "an aquatic amphibian with a long, snake-like body",
  "Griphognathus": "a lungfish known for its long, pointed snout",
  "Groenlandaspis": "a small, armored fish with a flat, shovel-like head shield",
  "Gyroptychius": "a small lungfish with a long, slender body",
  "Hadrosaurus": "a duck-billed dinosaur, one of the first dinosaurs found in North America",
  "Haramiyia": "one of the earliest known primitive mammals, It was a small, rodent-like mammal",
  "Harpagornis": "one of the largest eagles ever, with a wingspan of up to 10 feet and powerful talons for hunting",
  "Helicoprion": "a prehistoric shark-like fish famous for its bizarre lower jaw—a spiral-shaped \"tooth whorl\" that looked like a circular saw!",
  "Hemicyclaspis": "had a broad, horseshoe-shaped head shield that protected its eyes and gills",
  "Henodus": "a small, turtle-like reptile with a broad, flat shell and short legs",
  "Hesperornis": "a large, flightless diving bird. It had teeth and strong legs for swimming and hunting fish",
  "Heterodontosaurus": "a small dinosaur. It had tusks like a boar and different teeth for cutting and grinding plants",
  "Holoptychius": "a small lungfish",
  "Homalcocephale": "a medium-sized pachycephalosaur. Its skull was flat and thick, not dome-shaped",
  "Hovasaurus": "a small, lizard-like marine reptile with a long body and slender limbs, perfect for swimming",
  "Hybodus": "a successful shark with two dorsal fins and small spines",
  "Hylaeosaurus": "one of the first dinosaurs ever discovered! This armored, plant-eating dinosaur had large, long spikes sticking out from its shoulders",
  "Hylonomus": "a small, lizard-like reptile, one of the oldest known reptiles!",
  "Hypacrosaurus": "a duck-billed dinosaur with a tall, rounded crest on its head",
  "Hyperodapedon": "a medium-sized reptile with a strong, robust body and a short tail",
  "Hypsilophodon": "a small, agile plant-eating dinosaur known for its speed",
  "Hypsognathus": "a small, lizard-like reptile with a long tail and short legs",
  "Ichthyornis": "a seabird with strong wings for flying, and, like some early birds, it still had teeth!",
  "Ichthyosaurus": "one of the first ichthyosaurs ever discovered. Characterized best by its dolphin-like body and long tail",
  "Ichthyostega": "one of the first animals with limbs! It had a flat, shovel-like head and could move on land, but it still spent most of its time in the water",
  "Iguanodon": "a large plant-eater known for its distinctive thumb spikes",
  "Ischnacanthus": "a spiny shark, small and slender",
  "Ischyodus": "a small, long-bodied chimera with a long, pointed snout",
  "Jamoytius": "a small, eel-like creature without a backbone",
  "Kannemeyeria": "a large, robust plant-eater",
  "Karaurus": "an early salamander, one of the earliest known modern-type amphibians",
  "Kentrosaurus": "a smaller relative of Stegosaurus, this plant-eater was covered in bony plates and had long, sharp, defensive spikes all down its back and tail",
  "Keraterpeton": "had a long tail and two small horn-like bumps on its head",
  "Kritosaurus": "a duck-billed dinosaur with a unique crest that looked like a 'Roman nose'",
  "Kronosaurus": "a gigantic, short-necked plesiosaur. It had a huge head and powerful flippers",
  "Kuehneosaurus": "a small, gliding reptile that had broad, wing-like extensions on its ribs that allowed it to glide from tree to tree",
  "Labidosaurus": "a small, lizard-like reptile with a long tail and short legs",
  "Lagosuchus": "a small, early reptile so similar to dinosaurs that scientists think it could have been a direct ancestor",
  "Lambeosaurus": "a duck-billed dinosaur with a hollow, hatchet-like crest on its head",
  "Lariosaurus": "a small, lizard-like reptile with a long body and short limbs",
  "Latimeria": "a modern coelacanth, a 'living fossil' that has been around for 400 million years",
  "Leptolepis": "a small, bony fish, an ancestor to modern teleosts",
  "Lesothosaurus": "small!. It was one of the earliest plant-eating dinosaurs and had long legs for running away from predators",
  "Limnofregata": "a frigate-like bird, with long wings and a forked tail",
  "Liopleurodon": "a very large, short-necked plesiosaur. It had a massive head and powerful flippers",
  "Longisquama": "a small, strange reptile that lived before the dinosaurs. It had a row of very long, unusual, feather-like scales sticking up from its back",
  "Lycaenops": "a medium-sized, dog-like meat-eater",
  "Lystrosaurus": "a common plant-eater, found worldwide! It had a stout body and tusks and survived the biggest extinction event in Earth's history!",
  "Macroplata": "a medium-sized, short-necked plesiosaur,",
  "Macropoma": "was a real-life cousin to the super-rare modern coelacanth, and looked a lot like a modern fish with a unique, three-part tail and stalked fins",
  "Maiasaura": "a duck-billed dinosaur famous for its nesting colonies, known as the 'good mother lizard'",
  "Mamenchisaurus": "this huge dinosaur was famous for having the longest neck of any known animal!",
  "Massetognathus": "a dog-sized cynodont, a mammal-like reptile that was likely herbivorous",
  "Massospondylus": "a great dino with a long neck and tail, and we've found so many fossils of it that we know a lot about how it lived",
  "Megalania": "a gigantic terrestrial lizard, and one of the largest land lizards ever!",
  "Megalosaurus": "a large hunter. It was the first dinosaur ever scientifically described!",
  "Megazostrodon": "a very early mammal. It was a tiny, shrew-like creature. It had a long tail and sharp teeth",
  "Meiolania": "a medium-sized turtle with a broad shell and a long tail that had spikes on it!",
  "Mesosaurus": "a small, aquatic reptile. Its discovery helped prove that these continents were once joined together!",
  "Metriorhynchus": "a large crocodile that had a long, narrow snout and a fish-like tail, allowing it to swim fast in the open ocean",
  "Milleretta": "a small, lizard-like reptile",
  "Mixosaurus": "a transitional ichthyosaur, showing features of both primitive and advanced forms",
  "Mosasaurus": "the first mosasaur ever found. It was a giant marine lizard and one of the most powerful marine predators of the Late Cretaceous",
  "Moschops": "a huge, plant-eating reptile. It had a thick, robust body and a small head",
  "Moythomasia": "a small fish with a long, slender body and a large dorsal fin on its back",
  "Muraenosaurus": "a long-necked plesiosaur, a marine reptile that likely hunted fish",
  "Mussaurus": "a small dinosaur. Its name means 'mouse lizard' because the first fossils found were tiny babies!",
  "Neocathartes": "a vulture-like bird with a hooked beak and long legs",
  "Nodosaurus": "an armored dinosaur that was heavily built with a short tail and stout legs",
  "Nothosaurus": "a strong swimmer with a long body and short limbs",
  "Oligokyphus": "a small, mammal-like reptile",
  "Ophiacodon": "a medium-sized, semi-aquatic reptile. It had a long, narrow head and strong jaws",
  "Ophiderpeton": "snake-like amphibians that were long and slender and had no limbs",
  "Ophthalmosaurus": "an ichthyosaur known for its extremely large eyes, adapted for deep-sea hunting",
  "Opisthocoelicaudia": "this 49-foot-long sauropod had a strong, stout tail that might have helped it stand up on two legs to reach high branches",
  "Ornitholestes": "a small, fast-running, two-legged meat-eater whose name means \"bird robber,\" though it probably ate small reptiles and mammals too",
  "Ornithomimus": "an 'ostrich-like' dinosaur, a fast-running theropod with a toothless beak",
  "Ornithosuchus": "a large, crocodile-like reptile that could walk on two legs for short periods",
  "Osteodontornis": "a huge seabird. It had a wingspan of up to 16 feet and a unique beak with bony \"pseudo-teeth\" for grabbing fish",
  "Osteolepis": "a small fish covered in thick, bony scales and was a relative of the first land animals",
  "Oviraptor": "a small, bird-like dinosaur with a crest on its head. Its name means 'egg thief' but it actually protected its nest",
  "Pachycephalosaurus": "the 'thick-headed lizard'. It had a massive, very thick dome-shaped skull",
  "Pachyrhachis": "a small marine snake. It was one of the earliest known snakes to live in the ocean",
  "Pachyrhinosaurus": "a large horned dinosaur that had a thick, bumpy boss instead of a horn on its nose",
  "Palaelodus": "a flamingo-like bird. It had a short, slender neck and long legs for wading",
  "Palaeobatrachus": "an ancient frog, an early relative of modern frogs",
  "Palaeoniscum": "a small fish with a long, slender body",
  "Palaeospondylus": "a small, eel-like fish. It's a mystery to scientists because it had a long, slender body but no jaws or fins",
  "Palaeotrionyx": "a small turtle with a broad shell and a long tail",
  "Panoplosaurus": "an armored dinosaur that was heavily built with a short tail and stout legs",
  "Pantylus": "a small amphibian with a short tail and short legs",
  "Paracyclotosaurus": "a large amphibian with a very broad, flat head",
  "Parasaurolophus": "a duck-billed dinosaur with a huge, backward-pointing tube on its head, which may have been used for making loud calls",
  "Pareiasaurus": "a large, robust reptile that was heavily built with a short tail and stout legs",
  "Peloneustes": "a pliosaur, a short-necked marine reptile with a large head and powerful jaws",
  "Peltobatrachus": "a small, armored amphibian with bony plates on its back",
  "Perleidus": "a small fish with a long, slender body",
  "Petrolacosaurus": "one of the earliest known diapsids. It was a small, lizard-like reptile with a long tail and slender legs",
  "Pharyngolepis": "a small, jawless fish with a well-developed dorsal fin",
  "Phorusrhacus": "the \"terror bird\". It was a giant predator, with a massive beak and strong legs for running",
  "Phthinosuchus": "a small meat-eater",
  "Pisanosaurus": " small, and is thought to be one of the most primitive members of the group of plant-eating dinosaurs",
  "Pistosaurus": "a small, lizard-like reptile that was a close relative of the nothosaurs",
  "Placochelys": "a small, turtle-like reptile with a broad, flat shell that looked like a turtle's",
  "Placodus": "one of the first placodonts, with strong, flat teeth for crushing shells",
  "Planocephalosaurus": "a small, lizard-like reptile. It was an early relative of the modern Tuatara and likely hunted insects",
  "Platecarpus": "a large marine lizard and powerful swimmer, a type of mosasaur",
  "Plateosaurus": "one of the first really big plant-eaters. It had a long neck and tail and strong back legs",
  "Platyhystrix": "an ancient, stocky amphibian (like a large salamander) that had a tall, flat, bony sail on its back, possibly to help it warm up or cool down",
  "Platysomus": "a small fish with a deep, flat body",
  "Plesiosaurus": "the first plesiosaur ever found! Its most distict features were its long neck, small head, and big flippers!",
  "Pleurosaurus": "a small, lizard-like marine reptile with a long body and slender limbs",
  "Pliosaurus": "a large, short-necked plesiosaur with a massive head and powerful jaws",
  "Plotosaurus": "another large mosasaur with a long body and tail, and was a fast swimmer",
  "Polacanthus": "an armored dinosaur with a large shield over its hips",
  "Postosuchus": "a large, heavily built predator that could walk on two legs",
  "Prenocephale": "a pachycephalosaur with a high, domed head, smaller than its famous relative",
  "Presbyornis": "a duck-like bird",
  "Pristichampsus": "a large, robust crocodile that lived on land and had powerful jaws and hoof-like claws, suggesting it was a fast runner",
  "Procompsognathus": "a small, bipedal carnivorous theropod from the late Triassic period",
  "Procynosuchus": "a small, semi-aquatic reptile",
  "Proganochelys": "one of the earliest turtles, with a heavily armored shell",
  "Prosaurolophus": "a duck-billed dinosaur with a small, solid crest on its head",
  "Proterosuchus": "an early reptile, an ancestor to crocodiles and dinosaurs, that looked like a large lizard with a distinctive, strong, hooked snout for catching prey",
  "Protorosaurus": "a medium-sized reptile with a long, slender body and a long tail",
  "Protostega": "a giant sea turtle! One of the largest turtles ever",
  "Protosuchus": "a small, robust crocodile. It looked like a mix between a modern crocodile and a lizard",
  "Pteranodon": "a very large pterosaur with a wingspan of up to 24 feet. It had a long, bony crest on its head and a toothless beak, and it was a big fish-eater",
  "Pteraspis": "a typical pteraspids with a head shield covered in small bony plates",
  "Pterodactylus": "a small pterosaur with a wingspan of about 2.5 feet. It had a short tail and was one of the first pterosaurs ever discovered",
  "Pterodaustro": "a medium-sized pterosaur with a wingspan of over 7 feet. It had a beak filled with tons of bristle-like teeth, which it used to filter tiny creatures from the water, just like a flamingo!",
  "Pteronisculus": "a small fish with a long, slender body",
  "Ptilodus": "a small, squirrel-like mammal. It had a long tail and sharp teeth",
  "Purgatorius": "a small, shrew-like mammal. It is considered an early ancestor of primates",
  "Pycnodus": "a small fish with a deep, flat body and crushing teeth for eating hard-shelled prey",
  "Quetzalcoatlus": "a gigantic pterosaur with a wingspan of up to 39 feet. It was one of the largest flying animals ever to exist!",
  "Rhamphorhynchus": "a medium-sized pterosaur with a wingspan of 3 feet. Its long tail had a special diamond-shaped fin on the end. It also ate fish",
  "Riojasaurus": "a large dino. It had a heavy body and strong legs, which means it likely walked on all fours most of the time",
  "Robertia": "a small plant-eater, one of the earliest dicynodonts",
  "Rutiodon": "a large, crocodile-like reptile. It was a fish-eater with a long, slender snout",
  "Saichania": "an armored dinosaur that was heavily built with a short tail and stout legs",
  "Saltasaurus": "a medium-sized sauropod. It's one of the most interesting sauropods because it was covered in bony plates, like a dinosaur with armor!",
  "Saltopus": "a very small, agile dinosaur",
  "Sarcosuchus": "a gigantic crocodile, one of the largest crocodiles ever to live",
  "Saurichthys": "a fish with a long, thin body and a long, pointed snout",
  "Saurolophus": "a duck-billed dinosaur with a solid, backward-pointing spike on its head",
  "Sauropelta": "an armored dinosaur that was heavily built with a short tail and stout legs",
  "Saurornithoides": "a medium-sized, intelligent hunter, with a large brain and eyes",
  "Saurornitholestes": "a small, bird-like hunter",
  "Scapanorhynchus": "a shark with a long, pointed snout like a goblin shark today",
  "Scaphognathus": "a small pterosaur with a wingspan of about 3 feet. It had a deep head and a short snout",
  "Scutellosaurus": "a tiny, 4-foot-long dino. It had a surprise—bony plates on its back, making it an early armored dinosaur",
  "Scutosaurus": "a large, robust reptile with a short tail and stout legs",
  "Seymouria": "so similar to reptiles that scientists once thought it was one!",
  "Shantungosaurus": "the largest duck-billed dinosaur ever found",
  "Shonisaurus": "a giant ichthyosaur. It had a long, slender body and a long tail",
  "Silvisaurus": "an armored dinosaur that was heavily built with a short tail and stout legs",
  "Sordes": "a tiny pterosaur with a wingspan of only 1.5 feet. Fossils show it had a fuzzy covering, which might mean it was warm-blooded!",
  "Spathobatis": "a ray with a broad, flat body with a long tail and large fins",
  "Sphenacodon": "a meat-eating reptile with a deep, narrow skull and sharp teeth",
  "Spinosaurus": "an enormous hunter. It was possibly the largest carnivorous dinosaur ever and is famous for its massive sail",
  "Stagonolepis": "heavily armored and had a pig-like snout",
  "Stegoceras": "a small pachycephalosaur. It had a cool, dome-shaped skull",
  "Stegosaurus": "a large plant-eater famous for its huge plates and spiked tail",
  "Stenonychosaurus": "a medium-sized hunter. It had the largest brain for its body size of any dinosaur",
  "Stenopterygius": "a common ichthyosaur, with a dolphin-like body shape",
  "Stethacanthus": "famous for a weird, flat, anvil-shaped fin on its back",
  "Strunius": "was a tiny, stubby-bodied fish that swam during the late Devonian period. Despite its small size, it was a ferocious predator whose super-strong, hinged skull helped it bite and crush the armor of other small fish",
  "Struthiosaurus": "a small armored dinosaur that was heavily built with a short tail and stout legs",
  "Stupendemys": "a stupendously large turtle, about the size of a car!",
  "Styracosaurus": "a large horned dinosaur with a huge nose horn and a frill with long spikes around the edge",
  "Supersaurus": "a gigantic sauropod. It was one of the longest dinosaurs ever found",
  "Talarurus": "an armored dinosaur that was heavily built with a short tail and stout legs",
  "Tanystropheus": "a medium-sized reptile with a short body but an extremely long neck",
  "Tarbosaurus": "a very large tyrannosaur, very similar to T. rex",
  "Teleosaurus": "a large, marine crocodile with a long snout, perfect for snatching up fish",
  "Temnodontosaurus": "a medium-sized ichthyosaur. It had a long, slender body and a long tail",
  "Tenontosaurus": "a large, plant-eating dinosaur known for its very long tail",
  "Teratosaurus": "a very large, meat-eating reptile, but not a dinosaur! It belonged to a group called Rauisuchians and was one of the top predators of the Late Triassic period",
  "Terrestrisuchus": "a small, slender crocodile. It had long legs and a long tail for a life on the ground",
  "Testudo": "similar to modern tortoises. It had a broad shell and a short tail",
  "Thadeosaurus": "a small, lizard-like marine reptile also built for a life in the water",
  "Thecodontosaurus": "a tiny European dinosaur. It was one of the first dinosaurs ever discovered!",
  "Thelodus": "a small fish covered in tiny bony scales",
  "Thescelosaurus": "a small, plant-eating dinosaur with a long tail and short legs",
  "Thrinaxodon": "a small, carnivorous cynodont, an important transitional fossil showing mammal-like traits",
  "Ticinosuchus": "a large, quadrupedal archosaur, a crocodile-line predator",
  "Titanosuchus": "a large, carnivorous dinocephalian, a 'terrible crocodile",
  "Torosaurus": "a large horned dinosaur with the largest frill of any known land animal",
  "Tremataspis": "a small fish with a huge, flat, shovel-shaped head shield that covered most of its body",
  "Triadobatrachus": "considered the oldest and most primitive relative of modern frogs. It was small, had a frog-like head, long hind legs, but still had a short tail!",
  "Triceratops": "a large horned dinosaur with three horns on its face and a massive frill",
  "Tristychius": "a small, slender shark with a long tail and two dorsal fins",
  "Tsintaosaurus": "a duck-billed dinosaur with a long, rod-like crest that stuck straight up from its head",
  "Tuojiangosaurus": "a large plant-eater famous for its huge plates and spiked tail",
  "Tyrannosaurus": "the most famous giant! With a huge head, powerful jaws, and tiny two-fingered arms",
  "Varanosaurus": "an early pelycosaur, a synapsid with a long snout resembling a monitor lizard",
  "Velociraptor": "a small but fierce hunter, also with a large sickle claw",
  "Vieraella": "one of the earliest known frogs",
  "Wuerhosaurus": "a large plant-eater famous for its huge plates and spiked tail",
  "Xenacanthus": "an eel-like shark with a long dorsal fin and a spine on its head",
  "Yinlong Downsi": "a small, early horned dinosaur",
  "Zalambdalestes": "a small, shrew-like mammal. It had a long snout and sharp teeth"
}